<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest LibreOffice.</string>
	<key>Identifier</key>
	<string>io.github.tom.download.LibreOfficeLangPack</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>LibreOfficeLangPack</string>
		<key>TYPE</key>
		<string>mac-x86</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>LibreOfficeURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>type</key>
				<string>%TYPE%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
      
	</array>
</dict>
</plist>
